import Translator from "./Translator";
import ReactMarkdown from 'react-markdown';


export default function TestMDPage() {
    const data = `
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
# Web и сервисы — открываем мир!
**Мастер: Марчук Александр Гурьевич**

**Подмастерье: Ноговицын Михаил**

Web-технологии и информационные системы всё активнее используют сервисы. Сервисы существенно
повышают гибкость ИТ-решений и упрощают разработку. В мастерской мы познакомимся с основами клиент-сервисной архитектуры, с языком C#, языками разметки и обмена данных HTML, XML, JSON. Это даст нам возможность создать информационную систему в виде Web-приложения, которая будет через сервисы
использовать разные внешние источники данных по тематике ЛШЮП. Будут использованы: историческая база данных и документов ЛШЮП, Telegram-канал и группа в VK, RSS-каналы и др. Результатом будет Web-сайт, знакомящий читателя с разными аспектами системы летних школ юных программистов (история, люди,
проекты, фотографии, видео).

Основной технологией создания Web-приложения будет современная, высокоэффективная среда ASP.NET, основным
языком программирования будет C#. Инструменты (система программирования, язык программирования, языки разметки) будут осваиваться в минимальном, но достаточном объеме. Поскольку сервисная архитектура позволяет разработчикам сосредотачиваться на конкретных сервисах, каждый ученик сможет решать посильную ему задачу, лучшие ученики будут объединять эти задачи в единую систему.

Мастерская предназначена не для тех, кто ищет в Интернете подходящее решение, чтобы изменить в нем пару
строчек и назвать его своим, а для тех, кому интересно понять, как все устроено, и писать свой код реализации. Желательны ученики с опытом работы над программами на языке высокого уровня.
`

    // let start = new Date().getTime();

    // longRunningFunction();

    // let end = new Date().getTime();

    // let time = end - start;

    // console.log('Время выполнения = ' + time);
    let start = new Date().getTime();
    const md1 = (<ReactMarkdown>{data}</ReactMarkdown>);
    console.log(md1)
    let medium = new Date().getTime();
    const md2 = <Translator>{data}</Translator>
    // const md3 = Translator({data})
    // console.log(md3)
    let end = new Date().getTime();
    console.log(start, medium, end)
    function update(){
        
    }
    return (
        <>
            {md1}{md2}
            <button onClick ={update}> Click me! </button>
        </>

    )
}
